// - Дано натуральное число n. Выведите все числа от 1 до n.

    // let func = (n) => {
    //     for (let i = 0; i <= n; i++) {
    //         if (i <= n) {
    //             console.log(i)
    //         }
    //     }
    //
    // }
    //
    // func(15);





// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

    // let func = (a,b) => {
    //     if (a < b){
    //         for (let i = a; i <= b; i++) {
    //             if ( i <= b){
    //                 console.log(i);
    //             }
    //         }
    //     }else if (b < a){
    //         for (let i = a; i >= b; i--) {
    //             if ( i >= b){
    //                 console.log(i);
    //             }
    //         }
    //     }
    // }
    // console.log(func(5,8))
    // console.log(func(10,2))
//
//
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
//      let array = [2,4,6,8];

    //  let func = (arg, num) => {
    //      if (num === arg.index){
    //
    //      }
    // }
//
// func(array,0);

    console.log(array.indexOf(4))





//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]